{"modelTopology":{"class_name":"Model","config":{"name":"model_9","layers":[{"name":"input_7","class_name":"InputLayer","config":{"batch_input_shape":[null,16384,2],"dtype":"float32","sparse":false,"name":"input_7"},"inbound_nodes":[]},{"name":"conv1d_12","class_name":"Conv1D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[7],"strides":[4],"padding":"same","dilation_rate":[1],"activation":"tanh","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_12","trainable":false},"inbound_nodes":[[["input_7",0,0,{}]]]},{"name":"batch_normalization_10","class_name":"BatchNormalization","config":{"axis":[2],"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_10","trainable":false},"inbound_nodes":[[["conv1d_12",0,0,{}]]]},{"name":"conv1d_13","class_name":"Conv1D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[7],"strides":[4],"padding":"same","dilation_rate":[1],"activation":"tanh","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_13","trainable":false},"inbound_nodes":[[["batch_normalization_10",0,0,{}]]]},{"name":"batch_normalization_11","class_name":"BatchNormalization","config":{"axis":[2],"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_11","trainable":false},"inbound_nodes":[[["conv1d_13",0,0,{}]]]},{"name":"conv1d_14","class_name":"Conv1D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[7],"strides":[4],"padding":"same","dilation_rate":[1],"activation":"tanh","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_14","trainable":false},"inbound_nodes":[[["batch_normalization_11",0,0,{}]]]},{"name":"batch_normalization_12","class_name":"BatchNormalization","config":{"axis":[2],"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_12","trainable":false},"inbound_nodes":[[["conv1d_14",0,0,{}]]]},{"name":"conv1d_15","class_name":"Conv1D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[7],"strides":[4],"padding":"same","dilation_rate":[1],"activation":"tanh","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_15","trainable":false},"inbound_nodes":[[["batch_normalization_12",0,0,{}]]]},{"name":"batch_normalization_13","class_name":"BatchNormalization","config":{"axis":[2],"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_13","trainable":false},"inbound_nodes":[[["conv1d_15",0,0,{}]]]},{"name":"conv1d_16","class_name":"Conv1D","config":{"filters":512,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[7],"strides":[4],"padding":"same","dilation_rate":[1],"activation":"tanh","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_16","trainable":false},"inbound_nodes":[[["batch_normalization_13",0,0,{}]]]},{"name":"batch_normalization_14","class_name":"BatchNormalization","config":{"axis":[2],"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_14","trainable":false},"inbound_nodes":[[["conv1d_16",0,0,{}]]]},{"name":"conv1d_17","class_name":"Conv1D","config":{"filters":1024,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[7],"strides":[4],"padding":"same","dilation_rate":[1],"activation":"tanh","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_17","trainable":false},"inbound_nodes":[[["batch_normalization_14",0,0,{}]]]},{"name":"lstm_6","class_name":"LSTM","config":{"units":256,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":true,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm_6","trainable":false},"inbound_nodes":[[["conv1d_17",0,0,{}]]]},{"name":"dense_54","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_54","trainable":true},"inbound_nodes":[[["lstm_6",0,1,{}]]]},{"name":"dense_30","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_30","trainable":false},"inbound_nodes":[[["lstm_6",0,1,{}]]]},{"name":"dense_33","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_33","trainable":false},"inbound_nodes":[[["lstm_6",0,1,{}]]]},{"name":"dense_36","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_36","trainable":false},"inbound_nodes":[[["lstm_6",0,1,{}]]]},{"name":"dense_39","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_39","trainable":false},"inbound_nodes":[[["lstm_6",0,1,{}]]]},{"name":"dense_42","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_42","trainable":false},"inbound_nodes":[[["lstm_6",0,1,{}]]]},{"name":"dense_45","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_45","trainable":false},"inbound_nodes":[[["lstm_6",0,1,{}]]]},{"name":"dense_48","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_48","trainable":false},"inbound_nodes":[[["lstm_6",0,1,{}]]]},{"name":"dense_55","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_55","trainable":true},"inbound_nodes":[[["dense_54",0,0,{}]]]},{"name":"dense_31","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_31","trainable":false},"inbound_nodes":[[["dense_30",0,0,{}]]]},{"name":"dense_34","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_34","trainable":false},"inbound_nodes":[[["dense_33",0,0,{}]]]},{"name":"dense_37","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_37","trainable":false},"inbound_nodes":[[["dense_36",0,0,{}]]]},{"name":"dense_40","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_40","trainable":false},"inbound_nodes":[[["dense_39",0,0,{}]]]},{"name":"dense_43","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_43","trainable":false},"inbound_nodes":[[["dense_42",0,0,{}]]]},{"name":"dense_46","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_46","trainable":false},"inbound_nodes":[[["dense_45",0,0,{}]]]},{"name":"dense_49","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_49","trainable":false},"inbound_nodes":[[["dense_48",0,0,{}]]]},{"name":"dense_56","class_name":"Dense","config":{"units":2,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_56","trainable":true},"inbound_nodes":[[["dense_55",0,0,{}]]]},{"name":"dense_32","class_name":"Dense","config":{"units":9,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_32","trainable":false},"inbound_nodes":[[["dense_31",0,0,{}]]]},{"name":"dense_35","class_name":"Dense","config":{"units":12,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_35","trainable":false},"inbound_nodes":[[["dense_34",0,0,{}]]]},{"name":"dense_38","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_38","trainable":false},"inbound_nodes":[[["dense_37",0,0,{}]]]},{"name":"dense_41","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_41","trainable":false},"inbound_nodes":[[["dense_40",0,0,{}]]]},{"name":"dense_44","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_44","trainable":false},"inbound_nodes":[[["dense_43",0,0,{}]]]},{"name":"dense_47","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_47","trainable":false},"inbound_nodes":[[["dense_46",0,0,{}]]]},{"name":"dense_50","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_50","trainable":false},"inbound_nodes":[[["dense_49",0,0,{}]]]}],"input_layers":[["input_7",0,0]],"output_layers":[["dense_56",0,0],["dense_32",0,0],["dense_35",0,0],["dense_38",0,0],["dense_41",0,0],["dense_44",0,0],["dense_47",0,0],["dense_50",0,0]]},"keras_version":"tfjs-layers 1.5.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_54/kernel","shape":[256,64],"dtype":"float32"},{"name":"dense_54/bias","shape":[64],"dtype":"float32"},{"name":"dense_55/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_55/bias","shape":[64],"dtype":"float32"},{"name":"dense_56/kernel","shape":[64,2],"dtype":"float32"},{"name":"dense_56/bias","shape":[2],"dtype":"float32"},{"name":"conv1d_12/kernel","shape":[7,2,32],"dtype":"float32"},{"name":"conv1d_12/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_10/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_10/beta","shape":[32],"dtype":"float32"},{"name":"batch_normalization_10/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_10/moving_variance","shape":[32],"dtype":"float32"},{"name":"conv1d_13/kernel","shape":[7,32,64],"dtype":"float32"},{"name":"conv1d_13/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_11/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_11/beta","shape":[64],"dtype":"float32"},{"name":"batch_normalization_11/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_11/moving_variance","shape":[64],"dtype":"float32"},{"name":"conv1d_14/kernel","shape":[7,64,128],"dtype":"float32"},{"name":"conv1d_14/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_12/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_12/beta","shape":[128],"dtype":"float32"},{"name":"batch_normalization_12/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_12/moving_variance","shape":[128],"dtype":"float32"},{"name":"conv1d_15/kernel","shape":[7,128,256],"dtype":"float32"},{"name":"conv1d_15/bias","shape":[256],"dtype":"float32"},{"name":"batch_normalization_13/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_13/beta","shape":[256],"dtype":"float32"},{"name":"batch_normalization_13/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_13/moving_variance","shape":[256],"dtype":"float32"},{"name":"conv1d_16/kernel","shape":[7,256,512],"dtype":"float32"},{"name":"conv1d_16/bias","shape":[512],"dtype":"float32"},{"name":"batch_normalization_14/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_14/beta","shape":[512],"dtype":"float32"},{"name":"batch_normalization_14/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_14/moving_variance","shape":[512],"dtype":"float32"},{"name":"conv1d_17/kernel","shape":[7,512,1024],"dtype":"float32"},{"name":"conv1d_17/bias","shape":[1024],"dtype":"float32"},{"name":"lstm_6/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"lstm_6/recurrent_kernel","shape":[256,1024],"dtype":"float32"},{"name":"lstm_6/bias","shape":[1024],"dtype":"float32"},{"name":"dense_30/kernel","shape":[256,64],"dtype":"float32"},{"name":"dense_30/bias","shape":[64],"dtype":"float32"},{"name":"dense_33/kernel","shape":[256,64],"dtype":"float32"},{"name":"dense_33/bias","shape":[64],"dtype":"float32"},{"name":"dense_36/kernel","shape":[256,64],"dtype":"float32"},{"name":"dense_36/bias","shape":[64],"dtype":"float32"},{"name":"dense_39/kernel","shape":[256,64],"dtype":"float32"},{"name":"dense_39/bias","shape":[64],"dtype":"float32"},{"name":"dense_42/kernel","shape":[256,64],"dtype":"float32"},{"name":"dense_42/bias","shape":[64],"dtype":"float32"},{"name":"dense_45/kernel","shape":[256,64],"dtype":"float32"},{"name":"dense_45/bias","shape":[64],"dtype":"float32"},{"name":"dense_48/kernel","shape":[256,64],"dtype":"float32"},{"name":"dense_48/bias","shape":[64],"dtype":"float32"},{"name":"dense_31/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_31/bias","shape":[64],"dtype":"float32"},{"name":"dense_34/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_34/bias","shape":[64],"dtype":"float32"},{"name":"dense_37/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_37/bias","shape":[64],"dtype":"float32"},{"name":"dense_40/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_40/bias","shape":[64],"dtype":"float32"},{"name":"dense_43/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_43/bias","shape":[64],"dtype":"float32"},{"name":"dense_46/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_46/bias","shape":[64],"dtype":"float32"},{"name":"dense_49/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_49/bias","shape":[64],"dtype":"float32"},{"name":"dense_32/kernel","shape":[64,9],"dtype":"float32"},{"name":"dense_32/bias","shape":[9],"dtype":"float32"},{"name":"dense_35/kernel","shape":[64,12],"dtype":"float32"},{"name":"dense_35/bias","shape":[12],"dtype":"float32"},{"name":"dense_38/kernel","shape":[64,1],"dtype":"float32"},{"name":"dense_38/bias","shape":[1],"dtype":"float32"},{"name":"dense_41/kernel","shape":[64,1],"dtype":"float32"},{"name":"dense_41/bias","shape":[1],"dtype":"float32"},{"name":"dense_44/kernel","shape":[64,1],"dtype":"float32"},{"name":"dense_44/bias","shape":[1],"dtype":"float32"},{"name":"dense_47/kernel","shape":[64,1],"dtype":"float32"},{"name":"dense_47/bias","shape":[1],"dtype":"float32"},{"name":"dense_50/kernel","shape":[64,1],"dtype":"float32"},{"name":"dense_50/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.5.2","convertedBy":null}